# Custom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Custom Property
UnitTypeId Class See Also
---
Unrecognized custom unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Custom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Custom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Custom {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace